base/InformationRegisters/бит_НазначенныеЗаместители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначенныеЗаместители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПередаватьПраваРЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СостоянияЗаместителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыВиз</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_ПраваУстановкиВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ПраваУстановкиВиз</Name>
			<Comment>Права установки виз</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Comment>Виза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыВиз</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Comment>Пользовательское условие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замещаемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсполнителиЗадач</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Comment>Роль исполнителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замещаемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_СостоянияЗаместителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СостоянияЗаместителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗавершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_НазначенныеЗаместители/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция инициализирует структуру параметров, используемую для передачи данных о заместителе.
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция КонструкторПараметрыНазначенияЗаместителя() Экспорт

	РезСтр = Новый Структура("ИмяКласса
	                           |,ОбластьЗамещения
							   |,Пользователь
							   |,Состояние
							   |,Виза
							   |,ПользовательскоеУсловие
							   |,РольИсполнителя
							   |,Заместитель
							   |,ПередаватьПраваРЛС
							   |,ДатаНачала
							   |,ДатаОкончания","ПараметрыНазначенияЗаместителя");
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	
	Для н = 1 По МаксКоличествоОбъектов Цикл
	
		РезСтр.Вставить("ОбъектАдресации_"+н);
	
	КонецЦикла;

	Возврат РезСтр;
	
КонецФункции // КонструкторСтруктурыЗаместителя()

// Функция определяет состояние для записи о назначении заместителя.
// 
// Параметры:
//    ДатаНачала - Дата
// 
// Возвращаемое значение:
//  ТекСостояние - ПеречислениеСсылка.бит_СостоянияЗаместителей.
// 
Функция ОпределитьСостояниеЗамещения(ДатаНачала, ДатаОкончания, ТекДата) Экспорт
	
	ТекСостояние = Перечисления.бит_СостоянияЗаместителей.Ожидание;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ ДатаНачала <= ТекДата Тогда
		
		ТекСостояние = Перечисления.бит_СостоянияЗаместителей.Назначен;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаОкончания) И КонецДня(ДатаОкончания) < ТекДата Тогда
		
		ТекСостояние = Перечисления.бит_СостоянияЗаместителей.ЗамещениеЗавершено;
		
	КонецЕсли; 
	
	Возврат ТекСостояние;
	
КонецФункции // ОпределитьСостояние()

// Процедура назначает заместителей в регистры бит_ПраваУстановкиВиз и бит_ИсполнителиЗадач.
// 
// Параметры:
//  СтрПар - Структура.ПараметрыНазначенияЗаместителя.
// 
Функция НазначитьЗаместителя(СтрПар, Протокол = "")  Экспорт

	Выполнено = Ложь;
	
 	ОпределитьОбластьЗамещения(СтрПар);
	
	ТабЗам = ПолучитьНазначенныхЗаместителей(СтрПар);
	КоличествоЗаписей = ТабЗам.Количество();	
	
	Если НеобходимоНазначитьЗаместителя(СтрПар, КоличествоЗаписей) Тогда
		
		Если СтрПар.ОбластьЗамещения = "Визы" Тогда			
			МенеджерЗаписи = РегистрыСведений.бит_ПраваУстановкиВиз.СоздатьМенеджерЗаписи();
		    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрПар);					
			МенеджерЗаписи.Пользователь = СтрПар.Заместитель;			
		ИначеЕсли СтрПар.ОбластьЗамещения = "Роли" Тогда			
			МенеджерЗаписи = РегистрыСведений.бит_ИсполнителиЗадач.СоздатьМенеджерЗаписи();
		    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрПар);					
			МенеджерЗаписи.Исполнитель = СтрПар.Заместитель;			
		КонецЕсли; 
		
		МенеджерЗаписи.Замещаемый = СтрПар.Пользователь;
		
		Попытка
			Если бит_ОбщегоНазначения.ПользовательНеактивен(СтрПар.Заместитель) Тогда
				ТекстИсключения = НСтр("ru='Пользователь %1 не активен';
								  		|en='User %1 not active'");
				ВызватьИсключение СтрШаблон(ТекстИсключения, МенеджерЗаписи.Пользователь);
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			Выполнено = Истина;			
			ТекстСообщения = НСтр("ru='Установлен заместитель ""%1"" пользователю ""%2"" по области замещения ""%3"".';
								  |en='Substitution ""%1"" is set for user ""%2"" for replacement area ""%3"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрПар.Заместитель, СтрПар.Пользователь, СтрПар.ОбластьЗамещения);
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось установить заместителя ""%1"" пользователю ""%2"" по области замещения ""%3"". Описание ошибки: ""%4"".';
								  |en='Unable to establish substituent ""%1"" user ""%2"" by replacement area ""%3"". Error description: ""%4"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрПар.Заместитель, СтрПар.Пользователь, СтрПар.ОбластьЗамещения, 
									   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));																						 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Если Выполнено И СтрПар.ПередаватьПраваРЛС Тогда
			бит_ПраваДоступа.ОбработатьНастройкиРЛСПользователя(СтрПар.Пользователь, СтрПар.Заместитель);
		КонецЕсли;

		Протокол = Протокол +?(ПустаяСтрока(Протокол), "", Символы.ПС) + ТекстСообщения;
		
	КонецЕсли; 

КонецФункции

// Функция удаляет назначенных заместителей из регистров 
// бит_ПраваУстановкиВиз, бит_ИсполнителиЗадач.
// 
// Параметры:
//  СтрПар - Структура.ПараметрыНазначенияЗаместителя.
// 
// Возвращаемое значение:
//  флВыполнено - Булево.
// 
Функция УдалитьНазначениеЗаместителей(СтрПар, Протокол = "") Экспорт

	Выполнено = Истина;
	
	ТабЗам = ПолучитьНазначенныхЗаместителей(СтрПар, Истина);
	
	Для каждого СтрокаТаблицы Из ТабЗам Цикл
	
		Если СтрПар.ОбластьЗамещения = "Визы" Тогда			
			МенеджерЗаписи = РегистрыСведений.бит_ПраваУстановкиВиз.СоздатьМенеджерЗаписи();			
		ИначеЕсли СтрПар.ОбластьЗамещения = "Роли" Тогда			
			МенеджерЗаписи = РегистрыСведений.бит_ИсполнителиЗадач.СоздатьМенеджерЗаписи();			
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТаблицы);
		
		Попытка		
			МенеджерЗаписи.Удалить();			
			ТекстСообщения = НСтр("ru='Удален заместитель ""%1"" пользователя ""%2"" по области замещения ""%3"".';
								  |en='Subsitute ""%1"" for the user ""%2"" for replacement area ""%3"" removed.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрПар.Заместитель, СтрПар.Пользователь, СтрПар.ОбластьЗамещения);
		Исключение			
			Выполнено = Ложь;			
			ТекстСообщения = НСтр("ru='Не удалось удалить заместителя ""%1"" пользователя ""%2"" по области замещения ""%3"". Описание ошибки: ""%4"".';
								  |en='Unable to remove substituent ""%1"" user ""%2"" by replacement area ""%3"". Error description: ""%4"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрПар.Заместитель, СтрПар.Пользователь, СтрПар.ОбластьЗамещения, 
									   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));																						 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Если Выполнено Тогда
			бит_ПраваДоступа.УдалитьПраваРЛСЗаместителя(СтрПар.Пользователь, СтрПар.Заместитель);
		КонецЕсли;
		
		Протокол = Протокол +?(ПустаяСтрока(Протокол), "", Символы.ПС) + ТекстСообщения;
		
	КонецЦикла; 

	Возврат Выполнено;
	
КонецФункции

// Функция формирует представление периода замещения.
// 
// Параметры:
//   СтрПар- Структура.ПараметрыНазначенияЗаместителя
// 
// Возвращаемое значение:
//  ПредставлениеПериода - Строка.
// 
Функция ПредставлениеПериодаЗамещения(СтрПар) Экспорт
	
	Если СтрПар.ДатаНачала = Неопределено Тогда
	
		 ПолучитьСведенияПоЗаместителю(СтрПар);
	
	КонецЕсли; 
	
	ПредставлениеПериода = НСтр("ru='Без ограничения';en='Without Restriction'");
	
	Если ЗначениеЗаполнено(СтрПар.ДатаНачала) И ЗначениеЗаполнено(СтрПар.ДатаОкончания) Тогда		
		ПредставлениеПериода = НСтр("ru='На период с %1 по %2';en='For the period from %1 to %2'");
        ПредставлениеПериода = СтрШаблон(ПредставлениеПериода, 
									Формат(СтрПар.ДатаНачала,"ДЛФ=D"), Формат(СтрПар.ДатаОкончания, "ДЛФ=D"));		
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрПар.ДатаНачала) И ЗначениеЗаполнено(СтрПар.ДатаОкончания) Тогда		
		ПредставлениеПериода = НСтр("ru='По %1';en='For %1'");
        ПредставлениеПериода = СтрШаблон(ПредставлениеПериода, Формат(СтрПар.ДатаОкончания, "ДЛФ=D"));		
	ИначеЕсли ЗначениеЗаполнено(СтрПар.ДатаНачала) И НЕ ЗначениеЗаполнено(СтрПар.ДатаОкончания) Тогда		
		ПредставлениеПериода = НСтр("ru='С %1';en='From %1'");
        ПредставлениеПериода = СтрШаблон(ПредставлениеПериода, Формат(СтрПар.ДатаНачала, "ДЛФ=D"));		
	КонецЕсли; 
	
	Возврат ПредставлениеПериода;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает сведения о назначенном заместителе.
// 
// Параметры:
//   СтрПар- Структура.ПараметрыНазначенияЗаместителя
// 
Процедура ПолучитьСведенияПоЗаместителю(СтрПар)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", СтрПар.Пользователь);
	Запрос.УстановитьПараметр("Заместитель", СтрПар.Заместитель);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НазначенныеЗаместители.Пользователь КАК Пользователь,
	|	бит_НазначенныеЗаместители.Состояние КАК Состояние,
	|	бит_НазначенныеЗаместители.Виза КАК Виза,
	|	бит_НазначенныеЗаместители.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	бит_НазначенныеЗаместители.РольИсполнителя КАК РольИсполнителя,
	|	бит_НазначенныеЗаместители.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	бит_НазначенныеЗаместители.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	бит_НазначенныеЗаместители.ОбъектАдресации_3 КАК ОбъектАдресации_3,
	|	бит_НазначенныеЗаместители.Заместитель КАК Заместитель,
	|	бит_НазначенныеЗаместители.ДатаНачала КАК ДатаНачала,
	|	бит_НазначенныеЗаместители.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.бит_НазначенныеЗаместители КАК бит_НазначенныеЗаместители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО бит_НазначенныеЗаместители.Заместитель = Пользователи.Ссылка
	|			И (бит_НазначенныеЗаместители.Пользователь = &Пользователь)
	|			И (бит_НазначенныеЗаместители.Заместитель = &Заместитель)
	|			И (НЕ Пользователи.ПометкаУдаления)
	|			И (НЕ Пользователи.Недействителен)";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрПар.ДатаНачала    = Выборка.ДатаНачала;
		СтрПар.ДатаОкончания = Выборка.ДатаОкончания;
		СтрПар.Состояние     = Выборка.Состояние;
	КонецЕсли;				  
	
КонецПроцедуры

// Функция получает назначенных заместителей.
// 
// Параметры:
//  СтрПар - Структура,
//	ВключаяНедействительных - Булево - Включать информацию о недействительных заместителях.
// 
// Возвращаемое значение:
//  ТабЗам - ТаблицаЗначений.
// 
Функция ПолучитьНазначенныхЗаместителей(СтрПар, ВключаяНедействительных = Ложь)

	ТабЗам = Новый ТаблицаЗначений;
	
	ОпределитьОбластьЗамещения(СтрПар);
	
	Если СтрПар.ОбластьЗамещения = "Визы" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Виза", СтрПар.Виза);
		Запрос.УстановитьПараметр("Заместитель", СтрПар.Заместитель);
		Запрос.УстановитьПараметр("Пользователь", СтрПар.Пользователь);
		Запрос.УстановитьПараметр("ВключаяНедействительных", ВключаяНедействительных);
		
		Если ЗначениеЗаполнено(СтрПар.ПользовательскоеУсловие) Тогда
			
			Запрос.УстановитьПараметр("ПользовательскоеУсловие", СтрПар.ПользовательскоеУсловие);
			
		Иначе
			
			Запрос.УстановитьПараметр("ПользовательскоеУсловие", Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка());
			
		КонецЕсли; 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПраваУстановкиВиз.Пользователь КАК Пользователь,
		|	ПраваУстановкиВиз.Виза КАК Виза,
		|	ПраваУстановкиВиз.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
		|	ПраваУстановкиВиз.Замещаемый КАК Замещаемый
		|ИЗ
		|	РегистрСведений.бит_ПраваУстановкиВиз КАК ПраваУстановкиВиз
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ПраваУстановкиВиз.Пользователь = Пользователи.Ссылка
		|ГДЕ
		|	ПраваУстановкиВиз.Виза = &Виза
		|	И ПраваУстановкиВиз.Пользователь = &Заместитель
		|	И ПраваУстановкиВиз.Замещаемый = &Пользователь
		|	И ПраваУстановкиВиз.ПользовательскоеУсловие = &ПользовательскоеУсловие
		|	И (&ВключаяНедействительных
		|			ИЛИ НЕ Пользователи.ПометкаУдаления
		|				И НЕ Пользователи.Недействителен)";
		
		Результат = Запрос.Выполнить();
		
		ТабЗам = Результат.Выгрузить();
		
	ИначеЕсли СтрПар.ОбластьЗамещения = "Роли" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РольИсполнителя", СтрПар.РольИсполнителя);
		
	    МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
		Для н = 1 По МаксКоличествоОбъектов Цикл
		
			Запрос.УстановитьПараметр("ОбъектАдресации_"+н, СтрПар["ОбъектАдресации_"+н]);
		
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("Заместитель",             СтрПар.Заместитель);
		Запрос.УстановитьПараметр("Пользователь",            СтрПар.Пользователь);
		Запрос.УстановитьПараметр("ВключаяНедействительных", ВключаяНедействительных);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
		|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
		|	ИсполнителиЗадач.ОбъектАдресации_1 КАК ОбъектАдресации_1,
		|	ИсполнителиЗадач.ОбъектАдресации_2 КАК ОбъектАдресации_2,
		|	ИсполнителиЗадач.ОбъектАдресации_3 КАК ОбъектАдресации_3,
		|	ИсполнителиЗадач.Замещаемый КАК Замещаемый
		|ИЗ
		|	РегистрСведений.бит_ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ИсполнителиЗадач.Исполнитель = Пользователи.Ссылка
		|ГДЕ
		|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
		|	И ИсполнителиЗадач.ОбъектАдресации_1 = &ОбъектАдресации_1
		|	И ИсполнителиЗадач.ОбъектАдресации_2 = &ОбъектАдресации_2
		|	И ИсполнителиЗадач.ОбъектАдресации_3 = &ОбъектАдресации_3
		|	И ИсполнителиЗадач.Исполнитель = &Заместитель
		|	И ИсполнителиЗадач.Замещаемый = &Пользователь
		|	И (&ВключаяНедействительных
		|			ИЛИ НЕ Пользователи.ПометкаУдаления
		|				И НЕ Пользователи.Недействителен)";
					   
		Результат = Запрос.Выполнить();
		
		ТабЗам = Результат.Выгрузить();
		
	КонецЕсли; 

	Возврат ТабЗам;
	
КонецФункции

// Функция проверяет необходимо ли выполнить назначение заместителя 
// в регистрах бит_ПраваУстановкиВиз и бит_ИсполнителиЗадач.
// 
// Параметры:
//  СтрПар - Структура.ПараметрыНазначенияЗаместителя
//  КоличествоНазначенных - Число.
// 
// Возвращаемое значение:
//  флНеобходимо - Булево.
// 
Функция НеобходимоНазначитьЗаместителя(СтрПар, КоличествоНазначенных)

	Если КоличествоНазначенных = 0
		И (НЕ ЗначениеЗаполнено(СтрПар.ДатаНачала)
			ИЛИ СтрПар.ДатаНачала <= ТекущаяДатаСеанса()) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

// Процедура определяет текущую область замещения.
// 
// Параметры:
//   СтрПар- Структура.ПараметрыНазначенияЗаместителя
// 
Процедура ОпределитьОбластьЗамещения(СтрПар)

	Если ЗначениеЗаполнено(СтрПар.РольИсполнителя) Тогда
		
		СтрПар.ОбластьЗамещения = "Роли";
		
	ИначеЕсли ЗначениеЗаполнено(СтрПар.Виза) Тогда	
		
		СтрПар.ОбластьЗамещения = "Визы";
		
	Иначе
		
		СтрПар.ОбластьЗамещения = "";
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#КонецЕсли
